Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t
Serialization structure for Tekla.Structures.Model.RebarComplexGeometry.

Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.MAX_REBAR_COMPLEX_GEOMETRY_LEG_COUNT
The maximum number of legs that can be transferred using this structure.

Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.WithHooks


Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.WithoutClashes


Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.LengthAdjustments


Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.Simplified


Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.ClientIdentifier


Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.ReinforcementIdentifier


Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.aDiametersAndBendings


Tekla.Structures.ModelInternal.dotRebarComplexGeometry_t.aLegOrigins
